welcome = "\n".join(
    [
        "Привіт 👋",
        "Радий, що ти зацікавився цим ботом 🤙",
        "Сподіваюсь, він хоч трохи полегшить твоє життя 🫶",
    ]
)

warning = "\n".join(
    [
        f"\n\n\n❗️ Можливі незначні відхилення відключень від графіку.",
        f"❗️ В разі різкого збільшення навантаження на мережі, диспетчер зобов'язаний на це повпливати. Єдиний варіант -- аварійне відключення.",
        f"❗️ Електроенергія може бути відсутня також і з інших причин, наприклад через аварійні або планові роботи в мережах.",
    ]
)

bot_info = "\n".join(
    [
        f"😡 Через дії російських окупантів пошкоджені електростанції України",
        f"🗓 Через це в кожній області запроваджують графіки погодинних відключень (ГПВ), згідно з якими вмикають/вимикають світло",
        f"🤯 В Чернівцях та області ГПВ змінюється щодня. Деколи графік може оновитись навіть посеред дня",
        f"🤩 Для того, щоб полегшити життя чернівчанам, створено цей бот. В ньому ви легко можете отримати інформацію про відключення електроенергії саме в вашій групі відключень",
        f"😋 Тепер не потрібно заходити на сайт ЧернівціОблЕнерго, шукати свою групу та запам'ятовувати, коли світло вимикатимуть",
        f"👌 Тепер все легше: ",
        f"      📍 Зайшов в чат з ботом @nopower_cv_bot",
        f"      📍 Запросив ГПВ для своєї групи (/my_group) або обрав іншу групу (/choose_group)",
        f"      📍 Бачиш графік відключень конкретно для обраної групи ✅",
        f"\n\n🤟 Бот написаний Батюком Максимом 🤟",
        f"🇺🇦 Слава Україні 🇺🇦",
    ]
)

help = "\n".join(
    [
        f"💠 Дозволені команди 💠\n",
        f"/start - Почати роботу бота",
        f"/choose_group - Обрати групу відключень",
        f"/my_group - Показати ГПВ для останньої вибраної групи",
        f"/info - Інформація про бота",
        f"/report - Повідомити про помилку",
        f"/help - Це меню",
    ]
)

report_request = "\n".join(
    [
        f"✏️ Опишіть вашу проблему.",
        f"📷 Якщо треба, прикріпіть одне фото/відео проблеми.",
        f"❗️ Все має бути описано в одному повідомленні.",
    ]
)

report_submitted = "\n".join(
    [
        f"🙏 Дякую за допомогу!",
        f"⚙️ Постараюсь виправити найближчим часом!",
    ]
)

invalid_table_provided = "\n".join(
    [
        "⚙️ Технічні неполадки ⚙️",
        "❗️ Формат подачі графіків відключень на сайті ЧернівціОблЕнерго змінився.",
        "😔 Бот тимчасово не може правильно обробляти дані.",
        "💪 Бот відновить роботу найближчим часом",
        "🫶 Прошу вибачення за незручності.",
        "\n👉 Тим часом можете вручну переглянути <a href='https://oblenergo.cv.ua/shutdowns/'>графік</a> відключень.",
    ]
)

using_previous_table = "\n".join(
    [
        "\n\n❗️ Формат подачі графіків відключень на сайті ЧернівціОблЕнерго змінився.",
        "❗️ Бот тимчасово використовує попередні дані. Згодом будуть використовуватись оновлені дані."
    ]
)


def gpv_info(group, ranges):
    text = "\n".join(
        [
            f"💡 Ви обрали групу №{group}",
            f"🕑 Згідно з <a href='https://oblenergo.cv.ua/shutdowns/'>графіком</a>, сьогодні у вас не буде світла в такі години:\n",
        ]
        + [
            # f"{'📍' if status == 'r' else '🔸'} {start:02}:00 - {end:02}:00"
            f"📍 {start:02}:00 - {end:02}:00"
            for status, start, end in ranges
        ]
        + [
            "\n".join(
                [
                    # "\n📎 Позначення:",
                    # "📍 - Світло відсутнє.",
                    # "🔸 - Світло можливо відсутнє.",
                    "\n❗️ Можливе заживлення в перші та останні години відключення.",
                    "❗️ Ці зони називаються \"сірими\".",
                ]
            )
        ]
    )
    return text
